#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.example: Reading...
aws_cloudwatch_log_group.future_climate: Refreshing state... [id=/aws/lambda/c18-climate-monitor-future-predictions-lambda]
aws_cloudwatch_log_group.new_location_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-new-location-orchestrator-lambda]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_ecr_repository.notifications: Refreshing state... [id=c18-climate-monitor-notifications-ecr]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_iam_role.orchestrator_lambda: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam]
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_cloudwatch_log_group.notifications: Refreshing state... [id=/aws/lambda/c18-climate-monitor-notifications-lambda]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_cloudwatch_log_group.streamlit_logs: Refreshing state... [id=/ecs/c18-climate-monitor-dashboard]
aws_cloudwatch_log_group.live_flood_warnings: Refreshing state... [id=/aws/lambda/c18-climate-monitor-live-flood-warnings-lambda]
aws_security_group.streamlit_sg: Refreshing state... [id=sg-0b8a3ef88dee6231b]
aws_cloudwatch_log_group.current_reading_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-reading-orchestrator-lambda]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_iam_role.email_lambda: Refreshing state... [id=c18-climate-monitor-email-lambda-iam]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole]
aws_cloudwatch_log_group.location_assignment: Refreshing state... [id=/aws/lambda/c18-climate-monitor-location-assignment-lambda]
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_cloudwatch_log_group.daily_summary: Refreshing state... [id=/aws/lambda/c18-climate-monitor-daily-summary-lambda]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
data.aws_ecs_cluster.existing: Reading...
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_iam_role.lambda_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam]
aws_ecr_repository.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-ecr]
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.orchestrator_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.invoke_lambdas: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam:invoke-other-lambdas]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_iam_role_policy.ses: Refreshing state... [id=c18-climate-monitor-email-lambda-iam:invoke-ses]
aws_iam_role_policy_attachment.email_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-email-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.ses_verify: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole:invoke-send-verify-email]
aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_iam_role_policy.pipeline_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam:c18-climate-monitor-scheduler-policy]
aws_lambda_function.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-lambda]
data.aws_ecs_cluster.existing: Read complete after 0s [id=arn:aws:ecs:eu-west-2:129033205317:cluster/c18-ecs-cluster]
aws_ecs_task_definition.streamlit_dashboard: Refreshing state... [id=streamlit-dashboard-task]
aws_lambda_function.future_climate: Refreshing state... [id=c18-climate-monitor-future-predictions-lambda]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]
aws_lambda_function.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-lambda]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.notifications: Refreshing state... [id=c18-climate-monitor-notifications-lambda]
aws_lambda_function.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]
aws_lambda_function.live_flood_warnings: Refreshing state... [id=c18-climate-monitor-live-flood-warnings-lambda]
aws_lambda_function.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-lambda]
aws_ecs_service.streamlit_service: Refreshing state... [id=arn:aws:ecs:eu-west-2:129033205317:service/c18-ecs-cluster/c18-climate-monitor-dashboard-service]
aws_scheduler_schedule.daily_summary_scheduler: Refreshing state... [id=default/c18-climate-monitor-daily-summary-scheduler]
aws_scheduler_schedule.notifications_scheduler: Refreshing state... [id=default/c18-climate-monitor-notifications-scheduler]
aws_scheduler_schedule.live_flood_warnings_scheduler: Refreshing state... [id=default/c18-climate-monitor-live-flood-warnings-scheduler]
aws_scheduler_schedule.current_reading_orchestrator_scheduler: Refreshing state... [id=default/c18-climate-monitor-current_reading_orchestrator-scheduler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.streamlit_service will be updated in-place
  ~ resource "aws_ecs_service" "streamlit_service" {
        id                                 = "arn:aws:ecs:eu-west-2:129033205317:service/c18-ecs-cluster/c18-climate-monitor-dashboard-service"
        name                               = "c18-climate-monitor-dashboard-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:129033205317:task-definition/streamlit-dashboard-task:10" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.streamlit_dashboard must be replaced
-/+ resource "aws_ecs_task_definition" "streamlit_dashboard" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:129033205317:task-definition/streamlit-dashboard-task:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:129033205317:task-definition/streamlit-dashboard-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "streamlit-dashboard-task" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @lindengraves, Action: `pull_request`*